TestPlans/Home/Home Protect/xml/HPT3_25112014_4.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tem="http://tempuri.org/" xmlns:web="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd">
  <soap:Body>
    <tem:GetQuote>
      <tem:userName>Compare the Market</tem:userName>
      <tem:passWord>1254CTM2014</tem:passWord>
      <tem:quotationDataXml>&lt;web:QuestionData xmlns:web="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;
  &lt;web:TitleID&gt;005&lt;/web:TitleID&gt;
  &lt;web:FirstName&gt;Deborah&lt;/web:FirstName&gt;
  &lt;web:LastName&gt;Four&lt;/web:LastName&gt;
  &lt;web:DateOfBirth&gt;1963-04-17&lt;/web:DateOfBirth&gt;
  &lt;web:Sex&gt;F&lt;/web:Sex&gt;
  &lt;web:MaritalStatusID originalvalueid="Divorced/Dissolved"&gt;5&lt;/web:MaritalStatusID&gt;
  &lt;web:OccupationID originalvalueid="Broadcasting Engineer"&gt;E11&lt;/web:OccupationID&gt;
  &lt;web:BusinessID originalvalueid="Television"&gt;166&lt;/web:BusinessID&gt;
  &lt;web:Email&gt;michael.hudson@emailreaction.org&lt;/web:Email&gt;
  &lt;web:DaytimeTelephoneNumber&gt;01778 852852&lt;/web:DaytimeTelephoneNumber&gt;
  &lt;web:HouseNumber&gt;Byways&lt;/web:HouseNumber&gt;
  &lt;web:Street1&gt;Rippons Drove&lt;/web:Street1&gt;
  &lt;web:Street2&gt;Northborough&lt;/web:Street2&gt;
  &lt;web:TownCity&gt;Peterborough&lt;/web:TownCity&gt;
  &lt;web:County&gt;Cambridgeshire&lt;/web:County&gt;
  &lt;web:Postcode&gt;PE6 9AG&lt;/web:Postcode&gt;
  &lt;web:IsSameAsRiskAddress&gt;0&lt;/web:IsSameAsRiskAddress&gt;
  &lt;web:PropertyHouseNumber&gt;Honeysuckle Cottage&lt;/web:PropertyHouseNumber&gt;
  &lt;web:PropertyStreet1&gt;Goose Green&lt;/web:PropertyStreet1&gt;
  &lt;web:PropertyStreet2&gt;Gomshall&lt;/web:PropertyStreet2&gt;
  &lt;web:PropertyTownCity&gt;Guildford&lt;/web:PropertyTownCity&gt;
  &lt;web:PropertyCounty&gt;Surrey&lt;/web:PropertyCounty&gt;
  &lt;web:PropertyPostcode&gt;GU5 9LL&lt;/web:PropertyPostcode&gt;
  &lt;web:IsJointApplicant&gt;1&lt;/web:IsJointApplicant&gt;
  &lt;web:SoleOccupancy originalvalueid="Shared by working people"&gt;0&lt;/web:SoleOccupancy&gt;
  &lt;web:WhoElseLives originalvalueid="Shared by working people"&gt;HOU01&lt;/web:WhoElseLives&gt;
  &lt;web:HaveConvictions&gt;0&lt;/web:HaveConvictions&gt;
  &lt;web:BankruptOrCCJOrIVA&gt;0&lt;/web:BankruptOrCCJOrIVA&gt;
  &lt;web:RefusedCancelled&gt;0&lt;/web:RefusedCancelled&gt;
  &lt;web:JointPolicyHolder&gt;
    &lt;web:JPTitleID&gt;005&lt;/web:JPTitleID&gt;
    &lt;web:JPFirstName&gt;Joint&lt;/web:JPFirstName&gt;
    &lt;web:JPLastName&gt;Policyholder&lt;/web:JPLastName&gt;
    &lt;web:JPDateOfBirth&gt;1960-01-01&lt;/web:JPDateOfBirth&gt;
    &lt;web:JPSex&gt;F&lt;/web:JPSex&gt;
    &lt;web:JPRelationshipID originalvalueid="Employer"&gt;6&lt;/web:JPRelationshipID&gt;
    &lt;web:JPOccupationID originalvalueid="Self Employed"&gt;C37&lt;/web:JPOccupationID&gt;
    &lt;web:JPBusinessID originalvalueid="Self Employed"&gt;AGG99&lt;/web:JPBusinessID&gt;
  &lt;/web:JointPolicyHolder&gt;
  &lt;web:PreviouslyBoughtHomeInsurance&gt;1&lt;/web:PreviouslyBoughtHomeInsurance&gt;
  &lt;web:StartDate&gt;2014-10-30&lt;/web:StartDate&gt;
  &lt;web:CoverTypeID originalvalueid="Buildings &amp;amp; Contents Cover"&gt;1&lt;/web:CoverTypeID&gt;
  &lt;web:NumberOfYearsInsuranceHeld originalvalueid="3 years"&gt;3&lt;/web:NumberOfYearsInsuranceHeld&gt;
  &lt;web:PreviousClaims&gt;1&lt;/web:PreviousClaims&gt;
  &lt;web:Claim xmlns="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd"&gt;
    &lt;web:ClaimDate&gt;2011-09-01&lt;/web:ClaimDate&gt;
    &lt;web:ClaimAmount&gt;9999999&lt;/web:ClaimAmount&gt;
    &lt;web:ClaimTypeID originalvalueid="escape of water"&gt;DA&lt;/web:ClaimTypeID&gt;
    &lt;web:ClaimSection&gt;2&lt;/web:ClaimSection&gt;
    &lt;web:ClaimAtCurrentProperty&gt;0&lt;/web:ClaimAtCurrentProperty&gt;
  &lt;/web:Claim&gt;
  &lt;web:HRI xmlns="http://www.webmoney.co.uk/xsd/Hp2Xml.xsd"&gt;
    &lt;web:HRICategoryID originalvalueid="mobile phones"&gt;M03&lt;/web:HRICategoryID&gt;
    &lt;web:HRIDescription&gt;HTC Diamond Encrusted&lt;/web:HRIDescription&gt;
    &lt;web:HRIValue&gt;1800&lt;/web:HRIValue&gt;
  &lt;/web:HRI&gt;
  &lt;web:PropertyTypeID originalvalueid="Detached House"&gt;2&lt;/web:PropertyTypeID&gt;
  &lt;web:YearBuilt&gt;1983&lt;/web:YearBuilt&gt;
  &lt;web:Bedrooms originalvalueid="Three"&gt;3&lt;/web:Bedrooms&gt;
  &lt;web:WallConstructionID originalvalueid="Timber frame with brick walls"&gt;03&lt;/web:WallConstructionID&gt;
  &lt;web:RoofConstructionID originalvalueid="Felt on timber"&gt;04&lt;/web:RoofConstructionID&gt;
  &lt;web:Roof33PercentFlat&gt;0&lt;/web:Roof33PercentFlat&gt;
  &lt;web:RoofThatched&gt;0&lt;/web:RoofThatched&gt;
  &lt;web:PropertyListed&gt;0&lt;/web:PropertyListed&gt;
  &lt;web:SignsOfSubsidence&gt;1&lt;/web:SignsOfSubsidence&gt;
  &lt;web:YearOfSubsidence&gt;2006&lt;/web:YearOfSubsidence&gt;
  &lt;web:OnlySubsidenceIncident&gt;1&lt;/web:OnlySubsidenceIncident&gt;
  &lt;web:SubsidenceCauseTypeID&gt;DRA02&lt;/web:SubsidenceCauseTypeID&gt;
  &lt;web:SubsidenceMainPropertyAffected&gt;1&lt;/web:SubsidenceMainPropertyAffected&gt;
  &lt;web:SubsidenceInNeighbourhood&gt;0&lt;/web:SubsidenceInNeighbourhood&gt;
  &lt;web:IssueRectified&gt;1&lt;/web:IssueRectified&gt;
  &lt;web:IssueRectified&gt;1&lt;/web:IssueRectified&gt;
  &lt;web:underpinned&gt;0&lt;/web:underpinned&gt;
  &lt;web:GoodStateOfRepair&gt;1&lt;/web:GoodStateOfRepair&gt;
  &lt;web:OwnershipTypeID originalvalueid="Mortgaged/Owned - Not rented out"&gt;OWN01&lt;/web:OwnershipTypeID&gt;
  &lt;web:OccupiedWhenID originalvalueid="Occupied Day and Night"&gt;OCC03&lt;/web:OccupiedWhenID&gt;
  &lt;web:ConsecutiveDaysUnoccupiedID originalvalueid="Up to 45"&gt;30&lt;/web:ConsecutiveDaysUnoccupiedID&gt;
  &lt;web:DomesticUseOnly originalvalueid="Other business use"&gt;0&lt;/web:DomesticUseOnly&gt;
  &lt;web:FrequencyOfVisitor&gt;1&lt;/web:FrequencyOfVisitor&gt;
  &lt;web:HowManyAtOneTime&gt;1&lt;/web:HowManyAtOneTime&gt;
  &lt;web:MainIncome&gt;1&lt;/web:MainIncome&gt;
  &lt;web:OfficeSelfContained&gt;0&lt;/web:OfficeSelfContained&gt;
  &lt;web:CommercialInsurance&gt;0&lt;/web:CommercialInsurance&gt;
  &lt;web:NumStaffEmployed&gt;1&lt;/web:NumStaffEmployed&gt;
  &lt;web:EmployersLiabilityInsurance&gt;1&lt;/web:EmployersLiabilityInsurance&gt;
  &lt;web:EscortedOnAndOff&gt;1&lt;/web:EscortedOnAndOff&gt;
  &lt;web:BusinessEquipmentCoverRequired&gt;0&lt;/web:BusinessEquipmentCoverRequired&gt;
  &lt;web:BusinessStockAtProperty&gt;0&lt;/web:BusinessStockAtProperty&gt;
  &lt;web:PropertyUseType&gt;HOL01&lt;/web:PropertyUseType&gt;
  &lt;web:MainLocksID originalvalueid="Basic lock such as Yale"&gt;99&lt;/web:MainLocksID&gt;
  &lt;web:PatioLocksID originalvalueid="Key operated multi point lock"&gt;4&lt;/web:PatioLocksID&gt;
  &lt;web:OtherLocksID originalvalueid="2 key operated bolts (1 top &amp;amp;  1 bottom)"&gt;6&lt;/web:OtherLocksID&gt;
  &lt;web:KeyOperatedWindows&gt;1&lt;/web:KeyOperatedWindows&gt;
  &lt;web:BurglarAlarm&gt;0&lt;/web:BurglarAlarm&gt;
  &lt;web:NACOSSApproved&gt;0&lt;/web:NACOSSApproved&gt;
  &lt;web:Safe&gt;1&lt;/web:Safe&gt;
  &lt;web:SmokeAlarm&gt;1&lt;/web:SmokeAlarm&gt;
  &lt;web:Within200mWater&gt;0&lt;/web:Within200mWater&gt;
  &lt;web:BuildingsSumInsured&gt;100000&lt;/web:BuildingsSumInsured&gt;
  &lt;web:BuildingsAccidentalDamage&gt;0&lt;/web:BuildingsAccidentalDamage&gt;
  &lt;web:BuildingsVolExcess originalvalueid="100"&gt;100&lt;/web:BuildingsVolExcess&gt;
  &lt;web:ContentsSumInsured&gt;99000&lt;/web:ContentsSumInsured&gt;
  &lt;web:ContentsAccidentalDamage&gt;0&lt;/web:ContentsAccidentalDamage&gt;
  &lt;web:ContentsVolExcess originalvalueid="100"&gt;100&lt;/web:ContentsVolExcess&gt;
&lt;/web:QuestionData&gt;</tem:quotationDataXml>
    </tem:GetQuote>
  </soap:Body>
</soap:Envelope>